[
{"url": "https://pokemondb.net/ability/aftermath", "name": "Aftermath ", "desc": "If an attacker faints a Pokémon with   using a contact move, the attacker will lose   of their maximum HP."},
{"url": "https://pokemondb.net/ability/corrosion", "name": "Corrosion ", "desc": "allows the bearer to poison any Pokémon, including Steel and Poison types."},
{"url": "https://pokemondb.net/ability/aerilate", "name": "Aerilate ", "desc": "causes all  -type attacking moves used by the Pokémon to become  -type, and increase in power by 20%. Flying-type Pokémon also gain   from those moves (which means an effective increase of 80%). In  ,   increases affected moves' power by 30%. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/curious-medicine", "name": "Curious Medicine ", "desc": "Resets all stat changes upon entering battlefield.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/cursed-body", "name": "Cursed Body ", "desc": "May disable a move used on the Pokémon."},
{"url": "https://pokemondb.net/ability/contrary", "name": "Contrary ", "desc": "Makes stat changes have an opposite effect."},
{"url": "https://pokemondb.net/ability/costar", "name": "Costar ", "desc": "Copies ally's stat changes on entering battle.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/cotton-down", "name": "Cotton Down ", "desc": "When a Pokémon with   is hit by an attack, it lowers the attacker's Speed. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/cud-chew", "name": "Cud Chew ", "desc": "causes the Pokémon to reuse an already consumed Berry at the end of the next turn."},
{"url": "https://pokemondb.net/ability/comatose", "name": "Comatose ", "desc": "causes the Pokémon to behave as if it were asleep, though it doesn't officially have the Sleep status condition. It can still use its regular moves, but cannot be inflicted with any major status condition (sleep, poison, paralysis, burn, or freeze). Moves that target sleeping Pokémon (such as  ) work on a Pokémon with  , and the ability-bearer can use the moves   and  . The power of   and   still doubles when targeted at a   Pokémon (though Wake-Up Slap does not suppress  ).  cannot be removed or replaced via moves like   or the   ability. The move   and the   item do not work on a Pokémon with  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/competitive", "name": "Competitive ", "desc": "raises the ability-bearer's Special Attack by two stages when hit by a stat-lowering move. Stats can be raised to a maximum of +6 stages each."},
{"url": "https://pokemondb.net/ability/commander", "name": "Commander ", "desc": "Goes inside the mouth of an ally Dondozo if one is on the field.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/color-change", "name": "Color Change ", "desc": "changes the ability-bearer's type, when hit by a damage dealing move, to the type of that move. For example being hit by   will change the Pokémon to  -type. Dual-type Pokémon change to single-types. If a Pokémon with   has a  , the ability does not activate.   activates for the last strike of a multi-hit move. In  ,   activates on the first strike of a multi-hit move, thus subsequent hits may be not very effective. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/full-metal-body", "name": "Full Metal Body ", "desc": "Prevents other Pokémon from lowering its stats.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/compound-eyes", "name": "Compound Eyes ", "desc": "raises the ability-bearer's accuracy by 30%. In  , this ability's name was formatted as  . If a Pokémon with   is first in the party, Pokémon that can be holding items have that chance increase from 50% to 60% (for common items), 5% to 20% (for uncommon items) or 1% to 5% (for rare items)."},
{"url": "https://pokemondb.net/ability/cloud-nine", "name": "Cloud Nine ", "desc": "suppresses   effects brought on by weather, including move power increases, end-of-turn damage, accuracy changes, relevant abilities and so on."},
{"url": "https://pokemondb.net/ability/power-construct", "name": "Power Construct ", "desc": "is unique to Zygarde. When Zygarde 10% Forme or Zygarde 50% Forme falls below half HP, it changes into Zygarde Complete Forme. As Complete Forme has a higher base HP than the other two Formes, its HP is also restored by the same amount the maximum HP increased. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/storm-drain", "name": "Storm Drain ", "desc": "forces all single-target  -type moves - used by any other Pokémon on the field - to target this Pokémon, and with 100% accuracy. The ability is most useful in double/triple battles. When hit by the move, it deals no damage to the ability-bearer but raises its Special Attack by one stage. Stats can be raised to a maximum of +6 stages each.  will activate for an Water-type  , but not Water-type  . The ability is overridden by other Pokémon becoming the   from the moves   or  . In  ,   did not increase Special Attack nor give immunity to Water-type attacks. It also did not activate for  ."},
{"url": "https://pokemondb.net/ability/zen-mode", "name": "Zen Mode ", "desc": "changes the ability-bearer's form to   when their health falls below 50%. Currently it only applies to Darmanitan, whose form change makes it Fire/Psychic type and changes its stats around. No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/zero-to-hero", "name": "Zero to Hero ", "desc": "Transforms into its Hero Form when switching out.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/wonder-skin", "name": "Wonder Skin ", "desc": "halves the accuracy of all status moves targeted at the ability-bearer. It does not affect   status moves like   or  , nor does it affect the secondary conditions of attacking moves like  ."},
{"url": "https://pokemondb.net/ability/wind-power", "name": "Wind Power ", "desc": "If a Pokémon with   is hit by a wind move, the power of the next Electric-type move it uses is doubled. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/wind-rider", "name": "Wind Rider ", "desc": "gives immunity to wind moves, and causes the Pokémon's Attack to increase by one stage when hit by one. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/wonder-guard", "name": "Wonder Guard ", "desc": "prevents damage from direct attacks unless they are super-effective. Shedinja is the only Pokémon to have this ability so this means that only  ,  ,  ,   and   moves will have an effect. However, Pokémon protected by   are not immune to indirect attacks. Status-category moves still work and all end-of-turn damage will still incur, for example from poisoning, burns, sandstorms or hail. Entry hazards such as   or   will also damage Pokémon with   switching in. Attacks that do not take their type in account will also hit, such as  ,   or  . Since Shedinja only has 1 HP, any of the above damage will result in an instant knockout. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/wimp-out", "name": "Wimp Out ", "desc": "causes the bearer to switch out (or flee in a wild battle) when its HP falls below 50%. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/well-baked-body", "name": "Well-Baked Body ", "desc": "Immune to Fire-type moves, and Defense is sharply boosted.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/weak-armor", "name": "Weak Armor ", "desc": "When a Pokémon with   is hit by a physical move, its Defense drops one stage, but its Speed increases by one stage. Stats can be raised to a maximum of +6 stages each, or lowered to a minimum of -6 stages each."},
{"url": "https://pokemondb.net/ability/water-veil", "name": "Water Veil ", "desc": "Prevents the Pokémon from getting a burn."},
{"url": "https://pokemondb.net/ability/water-bubble", "name": "Water Bubble ", "desc": "reduces damage taken from Fire-type moves by 50%, and doubles the power of Water-type moves used by the ability-bearer. It also prevents the Pokémon from being burned. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/water-compaction", "name": "Water Compaction ", "desc": "raises the bearer's Defense by 2 stages when it is hit by a Water-type move. Stats can be raised to a maximum of +6 stages each. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/white-smoke", "name": "White Smoke ", "desc": "Prevents other Pokémon from lowering its stats.\n If a Pokémon with   is the leading party Pokémon, wild Pokémon are only half as likely to appear."},
{"url": "https://pokemondb.net/ability/water-absorb", "name": "Water Absorb ", "desc": "A Pokémon with   heals   of its maximum HP when hit by a  -type attack."},
{"url": "https://pokemondb.net/ability/wandering-spirit", "name": "Wandering Spirit ", "desc": "Swaps abilities with opponents on contact.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/adaptability", "name": "Adaptability ", "desc": "increases the effectiveness of   moves from the usual 1.5× to 2×. For example, a  -type Pokémon using   (base power 90) would normally get an effective power of 135. With   it would be 180 instead."},
{"url": "https://pokemondb.net/ability/vital-spirit", "name": "Vital Spirit ", "desc": "prevents the ability-bearer from falling asleep. This means that it also prevents the use of the move  . If a Pokémon with   is the leading party Pokémon, wild Pokémon are 50% more likely to be higher level."},
{"url": "https://pokemondb.net/ability/vessel-of-ruin", "name": "Vessel of Ruin ", "desc": "Lowers Special Attack of all Pokémon except itself.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/volt-absorb", "name": "Volt Absorb ", "desc": "A Pokémon with   heals   of its maximum HP when hit by an  -type attack, including  . In  ,   does not activate for  ."},
{"url": "https://pokemondb.net/ability/unnerve", "name": "Unnerve ", "desc": "Makes the foe nervous and unable to eat Berries."},
{"url": "https://pokemondb.net/ability/unaware", "name": "Unaware ", "desc": "Ignores any stat changes in the Pokémon."},
{"url": "https://pokemondb.net/ability/unseen-fist", "name": "Unseen Fist ", "desc": "Contact moves can strike through Protect/Detect.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/turboblaze", "name": "Turboblaze ", "desc": "prevents a target's ability from affecting moves that the   Pokémon uses. It only affects abilities that change the power, accuracy or other effects of moves. For example,   would be able to hit   (having  ) using a  -type move like  . Ground type moves would still not affect Flying types. However, using   against a Pokémon with   would still receive HP loss as Aftermath did not affect the   attack itself. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/transistor", "name": "Transistor ", "desc": "increases the power of Electric-type moves used by this Pokémon by 50%. It is the signature ability of Regieleki. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/triage", "name": "Triage ", "desc": "increases the priority of HP-restoring moves to +3, when used by the ability-bearer. Note: as   is currently the only Pokémon with this ability, the only moves affected in practice are  ,  ,  , and  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/victory-star", "name": "Victory Star ", "desc": "Boosts the accuracy of its allies and itself.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/truant", "name": "Truant ", "desc": "causes the ability-bearer to only attack every alternate turn. On the even turns, it will say the Pokémon is  . If a Pokémon with   uses a move that requires recharging on the second turn (such as  ), it will recharge on the same turn the Pokémon loafs around. Moves where the user prepares on the first turn and attacks on the second (such as   or  ) cannot be used. The moves  ,   and   do not work on Pokémon with  .  can technically be   away, however neither Slakoth, Slaking or Durant learn it."},
{"url": "https://pokemondb.net/ability/toxic-debris", "name": "Toxic Debris ", "desc": "Scatters poison spikes at the feet of the opposing team when the Pokémon takes damage from physical moves.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/trace", "name": "Trace ", "desc": "The Pokémon copies a foe's Ability.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/unburden", "name": "Unburden ", "desc": "Raises Speed if a held item is used."},
{"url": "https://pokemondb.net/ability/toxic-boost", "name": "Toxic Boost ", "desc": "Powers up physical attacks when poisoned.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/tinted-lens", "name": "Tinted Lens ", "desc": "Powers up “not very effective” moves."},
{"url": "https://pokemondb.net/ability/torrent", "name": "Torrent ", "desc": "increases the power of  -type moves by 50% (1.5×) when the ability-bearer's HP falls below a third of its maximum (known in-game as  )."},
{"url": "https://pokemondb.net/ability/toxic-chain", "name": "Toxic Chain ", "desc": "may cause bad poisoning when the Pokémon hits an opponent with a move.  is a new ability available in the Scarlet/Violet DLC. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/thermal-exchange", "name": "Thermal Exchange ", "desc": "Raises Attack when hit by a Fire-type move. Cannot be burned.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/tough-claws", "name": "Tough Claws ", "desc": "increases the power of moves that make contact. Most Physical-category moves are contact moves. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/thick-fat", "name": "Thick Fat ", "desc": "reduces the damage taken from  -type and  -type moves by 50%. Interestingly, many Pokémon possessing this ability already take reduced damage from those types. A   or   with   would take   normal damage when hit by an Ice-type move."},
{"url": "https://pokemondb.net/ability/teraform-zero", "name": "Teraform Zero ", "desc": "When Terapagos changes into its Stellar Form, it uses its hidden powers to eliminate all effects of weather and terrain, reducing them to zero. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/teravolt", "name": "Teravolt ", "desc": "prevents a target's ability from affecting moves that the   Pokémon uses. It only affects abilities that change the power, accuracy or other effects of moves. For example,   would be able to hit   (having  ) using a  -type move like  . Ground type moves would still not affect Flying types. However, using   against a Pokémon with   would still receive HP loss as Aftermath did not affect the   attack itself. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/tera-shift", "name": "Tera Shift ", "desc": "When the Pokémon enters a battle, it absorbs the energy around itself and transforms into its Terastal Form. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/tera-shell", "name": "Tera Shell ", "desc": "The Pokémon’s shell contains the powers of each type. All damage-dealing moves that hit the Pokémon when its HP is full will not be very effective. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/telepathy", "name": "Telepathy ", "desc": "Pokémon with the   ability will not take damage from teammates in double and triple battles. This affects moves such as   and  , which normally hit all Pokémon on the field apart from the user."},
{"url": "https://pokemondb.net/ability/technician", "name": "Technician ", "desc": "increases the power of moves - that are usually base power 60 or below - by 50%. Moves with variable base power are boosted only when it is 60 or below. For example, if   hits at level 6 it will be boosted from 50 to 75, but level 7 will stay at 70 base power. Moves like   that deal fixed HP damage are not affected by  ."},
{"url": "https://pokemondb.net/ability/tangling-hair", "name": "Tangling Hair ", "desc": "Contact with the Pokémon lowers the attacker's Speed stat.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/tangled-feet", "name": "Tangled Feet ", "desc": "Raises evasion if the Pokémon is confused."},
{"url": "https://pokemondb.net/ability/tablets-of-ruin", "name": "Tablets of Ruin ", "desc": "Lowers Attack of all Pokémon except itself.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/synchronize", "name": "Synchronize ", "desc": "If the opponent causes a burn, paralysis, or poisoning of a Pokémon with  , the opponent receives the status condition too. Self-inflicted status conditions (for example through the use of an item) are not passed on. In  , bad poison is only passed on as regular poison. If a Pokémon with   is the leading party Pokémon, there is a 50% chance of each wild Pokémon encountered having the same nature. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/symbiosis", "name": "Symbiosis ", "desc": "The Pokémon can pass an item to an ally.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/sword-of-ruin", "name": "Sword of Ruin ", "desc": "Lowers Defense of all Pokémon except itself.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/swift-swim", "name": "Swift Swim ", "desc": "doubles the ability-bearer's Speed during  ."},
{"url": "https://pokemondb.net/ability/sweet-veil", "name": "Sweet Veil ", "desc": "prevents this Pokémon and its allies from falling asleep, for example from moves like  ."},
{"url": "https://pokemondb.net/ability/swarm", "name": "Swarm ", "desc": "increases the power of  -type moves by 50% (1.5×) when the ability-bearer's HP falls below a third of its maximum (known in-game as  ). If a Pokémon with   is the leading party Pokémon, wild Pokémon are twice as likely to appear."},
{"url": "https://pokemondb.net/ability/super-luck", "name": "Super Luck ", "desc": "raises the ability-bearer's critical-hit ratio by one stage (for most moves this increases from a   chance to  )."},
{"url": "https://pokemondb.net/ability/supersweet-syrup", "name": "Supersweet Syrup ", "desc": "A sickly sweet scent spreads across the field the first time the Pokémon enters a battle, lowering the evasiveness of opposing Pokémon. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/sturdy", "name": "Sturdy ", "desc": "allows the Pokémon to survive with 1 HP if attacked at full HP with an attack that would otherwise knock it out. It also prevents One-Hit-KO moves ( ,  ,   or  ). If   activates before the final hit of a multi-hit move (such as  ), the subsequent hit will still deal damage and therefore cause the Pokémon to faint.  does not prevent self-inflicted KO moves such as  ,   and  ."},
{"url": "https://pokemondb.net/ability/surge-surfer", "name": "Surge Surfer ", "desc": "doubles the bearer's Speed when   is active. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/suction-cups", "name": "Suction Cups ", "desc": "prevents opponents forcing the ability-bearer to switch out or flee via the moves  ,  ,  , or  , or the item  . If a Pokémon with   is the leading party Pokémon, the chance of hooking a Pokémon during fishing increases. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/sticky-hold", "name": "Sticky Hold ", "desc": "prevents held items from being taken or switched. If a Pokémon with   is the leading party Pokémon, the chance of hooking a Pokémon during fishing increases."},
{"url": "https://pokemondb.net/ability/supreme-overlord", "name": "Supreme Overlord ", "desc": "Attack and Special Attack are boosted for each party Pokémon that has been defeated.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/strong-jaw", "name": "Strong Jaw ", "desc": "increases the power of all   moves by 50%. The attacks classed as biting moves are shown below with their normal and boosted power: No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/steely-spirit", "name": "Steely Spirit ", "desc": "Powers up ally Pokémon's Steel-type moves.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/steam-engine", "name": "Steam Engine ", "desc": "raises the user's Speed by three stages when it is hit by a Fire- or Water-type attack. The attack still deals damage. Stats can be raised to a maximum of +6 stages each. If a Pokémon with   (or   or  ) and a   are both in the party Pokémon, the number of steps required to hatch the egg are halved. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/steadfast", "name": "Steadfast ", "desc": "Raises Speed each time the Pokémon flinches."},
{"url": "https://pokemondb.net/ability/static", "name": "Static ", "desc": "If a Pokémon with   is hit by a move making contact, there is a 30% chance the foe will become paralyzed. If a Pokémon with   is the leading party Pokémon, it is 50% more likely that a wild Pokémon encountered will be   type."},
{"url": "https://pokemondb.net/ability/steelworker", "name": "Steelworker ", "desc": "increases the power of Steel-type moves used by this Pokémon by 50%. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/stance-change", "name": "Stance Change ", "desc": "is exclusive to  . When using a damage-dealing move,   switches to its Blade Forme. When using the move  ,   switches to its Shield Forme. The form change occurs when the appropriate move is selected, regardless of whether the attack goes ahead (e.g. prevented by paralysis). No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/stench", "name": "Stench ", "desc": "A Pokémon with   has a 10% chance of causing the opponent to flinch when hit by a damaging move (provided the ability-bearer strikes first as usual).  does not stack with the items   or  , so an ability-bearer holding either item will keep the flinch chance at 10%. In  ,   has no effect in battle. If a Pokémon with   is the leading party Pokémon, wild Pokémon are only half as likely to appear."},
{"url": "https://pokemondb.net/ability/stamina", "name": "Stamina ", "desc": "raises the bearer's Defense by one stage when it is attacked by any move. Stats can be raised to a maximum of +6 stages each. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/soul-heart", "name": "Soul-Heart ", "desc": "raises the bearer's Special Attack one stage when any Pokémon on the field faints. Stats can be raised to a maximum of +6 stages each. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/solid-rock", "name": "Solid Rock ", "desc": "reduces the damage taken from super-effective attacks by 25%. For example, a Water-type move used against a Rock-type Pokémon with   would deal 1.5× the usual damage instead of 2×. A double weakness would be reduced from 4× to 3×. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/stakeout", "name": "Stakeout ", "desc": "enables the Pokémon to deal twice the normal damage to any Pokémon that switches in or enters the field mid-battle."},
{"url": "https://pokemondb.net/ability/speed-boost", "name": "Speed Boost ", "desc": "Its Speed stat is gradually boosted."},
{"url": "https://pokemondb.net/ability/soundproof", "name": "Soundproof ", "desc": "grants the Pokémon immunity to all   moves, preventing all damage and effects. In   only, Pokémon with   could be cured of status conditions by  ."},
{"url": "https://pokemondb.net/ability/stalwart", "name": "Stalwart ", "desc": "Ignores moves and abilities that draw in moves.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/solar-power", "name": "Solar Power ", "desc": "During harsh sunlight,   raises the ability-bearer's Special Attack by 50%, but it also loses   of its maximum HP after each turn."},
{"url": "https://pokemondb.net/ability/stall", "name": "Stall ", "desc": "The Pokémon moves after all other Pokémon do.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/snow-cloak", "name": "Snow Cloak ", "desc": "raises ability-bearer's evasion by 20% in a hail storm. It also gives immunity to damage by hail (if they are not already protected by being   type). If a Pokémon with   is the leading party Pokémon while travelling in a hail storm/blizzard, wild Pokémon are only half as likely to appear."},
{"url": "https://pokemondb.net/ability/snow-warning", "name": "Snow Warning ", "desc": "creates a hailstorm when the ability-bearer enters battle. The effect lasts 5 turns, unless it is cleared via   or   or replaced by another weather condition. If multiple Pokémon with weather-generating abilities ( ,  ,   or  ) enter the field on the same turn, each weather condition will activate consecutively, fastest Pokémon first. In other words, the resultant weather condition will be that of the slowest Pokémon. Prior to  ,   lasts indefinitely upon activation."},
{"url": "https://pokemondb.net/ability/slush-rush", "name": "Slush Rush ", "desc": "Boosts the Pokémon's Speed stat in a hailstorm."},
{"url": "https://pokemondb.net/ability/skill-link", "name": "Skill Link ", "desc": "causes multi-strike moves to always hit their maximum number of times. The moves affected are listed below; note that moves such as   that always strike the same number of times are not affected. In  ,   is not affected by  ."},
{"url": "https://pokemondb.net/ability/simple", "name": "Simple ", "desc": "The   ability doubles the number of stages of all stat changes. Stats can be raised to a maximum of +6 stages each, or lowered to a minimum of -6 stages each. For example, using   would increase the Pokémon's attack by 4 stages instead of the usual 2. If   was targeted at a Pokémon with  , its Defense would drop 2 stages instead of 1. The move   can change a Pokémon's ability to  . In  ,   doubles the effects of stat changes but does not increase the actual number of stages. Stat increases are capped at the same multiplier of ×4, as per the table below. However, the resulting effect is exactly the same as current games."},
{"url": "https://pokemondb.net/ability/sniper", "name": "Sniper ", "desc": "increases the power of critical hits by 1.5×. This means a critical hit will deal   normal damage instead of 1.5×. In   critical hits deal 2× normal damage, so   inflicts   normal damage."},
{"url": "https://pokemondb.net/ability/slow-start", "name": "Slow Start ", "desc": "Temporarily halves Attack and Speed."},
{"url": "https://pokemondb.net/ability/shields-down", "name": "Shields Down ", "desc": "causes the Pokémon to changes its appearance and stats depending on its remaining HP. When the Pokémon's HP is over 50%, it has higher defenses and is immune to status conditions. When its HP falls below 50%, the outer shell breaks and the Pokémon has higher attack. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/shield-dust", "name": "Shield Dust ", "desc": "Blocks the added effects of attacks taken.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/shell-armor", "name": "Shell Armor ", "desc": "prevents the Pokémon from receiving a critical hit."},
{"url": "https://pokemondb.net/ability/shadow-shield", "name": "Shadow Shield ", "desc": "Reduces damage when HP is full.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/seed-sower", "name": "Seed Sower ", "desc": "Turns the ground into Grassy Terrain when the Pokémon is hit by an attack.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/shadow-tag", "name": "Shadow Tag ", "desc": "Prevents the foe from escaping."},
{"url": "https://pokemondb.net/ability/sharpness", "name": "Sharpness ", "desc": "increases the power of all   moves by 50%. The attacks classed as slicing moves are shown below with their normal and boosted power:"},
{"url": "https://pokemondb.net/ability/sheer-force", "name": "Sheer Force ", "desc": "increases the power of moves that have beneficial secondary effects by 30%, but removes those additional effects.  effects are defined as those that are positive for the user, such as: Non-beneficial effects, that   will not activate for, include: If the user is holding a   and uses an attack that activates  , it will not receive the 10% damage from  , but it gets boosts from both   and   (total of 69% base power increase).  normally has a 10% chance to burn the opponent. With  , Flamethrower's base power is boosted from 95 to 124, but it will never cause a burn. Note that if a move has an advantageous   disadvantageous side-effect,   still boosts the move but only the advantageous effect is removed. For example,   may cause a burn but also has recoil damage. A Pokémon with   using the move would gain the power increase and still receive recoil damage, but it would never cause a burn. Here are the moves that increase in power under  , listed alphabetically:"},
{"url": "https://pokemondb.net/ability/shed-skin", "name": "Shed Skin ", "desc": "The Pokémon may heal its own status problems."},
{"url": "https://pokemondb.net/ability/serene-grace", "name": "Serene Grace ", "desc": "doubles the chance of moves' secondary effects occurring - specifically stat changes, status ailments, or flinching. It also increases the chance of flinching due to the held items   and   from 10% to 20% (however, note that those items do not affect moves that already have a flinch chance).  does not affect status moves or the Pokémon's critical hit ratio.  normally has a 20% chance of lowering Special Defense; with   it is boosted to a 40% chance.  has a 30% of causing the target to flinch; with   it is boosted to a 60% chance. If the item   is held it does not increase that percentage, but rather if the move does not cause flinching (40% chance), then there is now a further 20% chance the target will flinch from  . This means   with   and   gives a total probability of 68% (1 - 0.4*0.8) that the opponent will flinch. In     does not increase the flinch chance of   or Razor Fang. In     does not affect the move  ."},
{"url": "https://pokemondb.net/ability/screen-cleaner", "name": "Screen Cleaner ", "desc": "Nullifies effects of Light Screen, Reflect, and Aurora Veil.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/scrappy", "name": "Scrappy ", "desc": "Enables moves to hit Ghost-type Pokémon."},
{"url": "https://pokemondb.net/ability/sand-veil", "name": "Sand Veil ", "desc": "raises the ability-bearer's evasion by 20% in a  . It also gives immunity to sandstorm damage (if they are not already protected by being  / /  type). If a Pokémon with   is the leading party Pokémon while travelling in a sandstorm, wild Pokémon are only half as likely to appear."},
{"url": "https://pokemondb.net/ability/sand-stream", "name": "Sand Stream ", "desc": "creates a sandstorm when the ability-bearer enters battle. The effect lasts 5 turns, unless it is cleared via   or   or replaced by another weather condition. If multiple Pokémon with weather-generating abilities ( ,  ,   or  ) enter the field on the same turn, each weather condition will activate consecutively, fastest Pokémon first. In other words, the resultant weather condition will be that of the slowest Pokémon. Prior to  ,   lasts indefinitely upon activation. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/schooling", "name": "Schooling ", "desc": "changes Wishiwashi into its School Form, if its HP is above 25% and Wishiwashi is at least level 20. If its HP falls below 25%, Wishiwashi will revert back to Solo Form.  cannot be removed or replaced via moves like   or the   ability. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/sap-sipper", "name": "Sap Sipper ", "desc": "Boosts Attack when hit by a Grass-type move."},
{"url": "https://pokemondb.net/ability/sand-spit", "name": "Sand Spit ", "desc": "Creates a sandstorm when hit by an attack.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/sand-rush", "name": "Sand Rush ", "desc": "doubles the ability-bearer's Speed during a  ."},
{"url": "https://pokemondb.net/ability/sand-force", "name": "Sand Force ", "desc": "raises the power of  ,   and   type moves by 30% during a  . It also grants immunity to the sandstorm damage, if not already immune (currently this only applies to Shellos since all other Pokémon with the ability are already immune)."},
{"url": "https://pokemondb.net/ability/rough-skin", "name": "Rough Skin ", "desc": "When a Pokémon with   is hit by a move that makes contact, the attacker receives damage equal to   of their maximum HP. Multi-hit moves (e.g.  ) activate   for each strike. In  , the damage from   is   of the maximum HP."},
{"url": "https://pokemondb.net/ability/rocky-payload", "name": "Rocky Payload ", "desc": "increases the power of Rock-type moves used by this Pokémon by 50%. No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/run-away", "name": "Run Away ", "desc": "allows the bearer to flee a battle with a wild Pokémon without fail, even if the opposing Pokémon has used a move like   or  , or has an ability such as  . Pokémon with   cannot switch out for another Pokémon, only flee. It does not allow the Pokémon to flee from Trainer battles."},
{"url": "https://pokemondb.net/ability/rock-head", "name": "Rock Head ", "desc": "Protects the Pokémon from recoil damage."},
{"url": "https://pokemondb.net/ability/rks-system", "name": "RKS System ", "desc": "Changes type depending on held item.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/rivalry", "name": "Rivalry ", "desc": "Deals more damage to a Pokémon of same gender."},
{"url": "https://pokemondb.net/ability/ripen", "name": "Ripen ", "desc": "Doubles the effect of berries.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/regenerator", "name": "Regenerator ", "desc": "A Pokémon with   restores   of its maximum HP when switching out."},
{"url": "https://pokemondb.net/ability/refrigerate", "name": "Refrigerate ", "desc": "causes all  -type attacking moves used by the Pokémon to become  -type, and increase in power by 20%. Ice-type Pokémon also gain   from those moves (which means an effective increase of 80%). In  ,   increases affected moves' power by 30%. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/reckless", "name": "Reckless ", "desc": "increases the power of   moves by 20%. By extension, this means the amount of recoil damage taken will increase as more damage is dealt (except for   and   which are based on the user's HP). The attacks classed as punching moves are shown below with their normal and boosted power:"},
{"url": "https://pokemondb.net/ability/rattled", "name": "Rattled ", "desc": "When a Pokémon with   is hit by a  ,   or   type move, its Speed is raised one stage (up to the usual maximum of +6 stages)."},
{"url": "https://pokemondb.net/ability/rain-dish", "name": "Rain Dish ", "desc": "A Pokémon with   will recover   of its maximum HP during rain, after each turn."},
{"url": "https://pokemondb.net/ability/receiver", "name": "Receiver ", "desc": "A Pokémon with   will inherit the ability of a teammate in a double/triple battle when that teammate faints. Abilities that activate upon entering the field, such as  , will activate when the Pokémon with   inherits it. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/quick-feet", "name": "Quick Feet ", "desc": "raises the ability-bearer's Speed by 50% when inflicted by a major status ailment (poison, burn, paralysis, freeze or sleep). If paralyzed, the Pokémon does not suffer the usual drop in Speed. All other effects of the status condition remain, e.g. losing HP each turn (poison, burn), or being unable to attack (paralysis, freeze, sleep). If a Pokémon with   is the leading party Pokémon, wild Pokémon are only half as likely to appear."},
{"url": "https://pokemondb.net/ability/quick-draw", "name": "Quick Draw ", "desc": "No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/queenly-majesty", "name": "Queenly Majesty ", "desc": "Prevents use of priority moves.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/quark-drive", "name": "Quark Drive ", "desc": "Raises highest stat on Electric Terrain, or if holding Booster Energy.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/purifying-salt", "name": "Purifying Salt ", "desc": "Protects from status conditions and halves damage from Ghost-type moves.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/pure-power", "name": "Pure Power ", "desc": "Raises the Pokémon's Attack stat.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/punk-rock", "name": "Punk Rock ", "desc": "Boosts sound-based moves and halves damage from the same moves.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/psychic-surge", "name": "Psychic Surge ", "desc": "creates a low-lying psychic field, like the move  , when the Pokémon enters battle. It prevents high-priority moves being used and increases the power of   type attacks."},
{"url": "https://pokemondb.net/ability/protosynthesis", "name": "Protosynthesis ", "desc": "Raises highest stat in harsh sunlight, or if holding Booster Energy.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/protean", "name": "Protean ", "desc": "changes the Pokémon's type to that of its previously used attack. No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/propeller-tail", "name": "Propeller Tail ", "desc": "Ignores moves and abilities that draw in moves.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/prism-armor", "name": "Prism Armor ", "desc": "reduces the damage taken from super-effective attacks by 25%. It is not affected by the abilities  ,  , or  . For example, a Dark-type move used against a Psychic-type Pokémon with   would deal 1.5× the usual damage instead of 2×. A double weakness would be reduced from 4× to 3×. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/primordial-sea", "name": "Primordial Sea ", "desc": "creates heavy rain when the ability is activated (by Kyogre reverting to its Primal form). Heavy rain has the same effects as   but with some additions: The abilities   or   are still able to bypass the effects of  , but   is not. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/prankster", "name": "Prankster ", "desc": "increases the priority of status moves by +1. This means that a slower Pokémon with   can use a status move before the opponent uses a regular move. Or if the ability-bearer is faster, it could use a status move before the opponent uses a priority move like  . The move   does not block moves whose priority is increased by   (but it does block moves that already have increased priority)."},
{"url": "https://pokemondb.net/ability/power-spot", "name": "Power Spot ", "desc": "Just being next to the Pokémon powers up moves.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/pressure", "name": "Pressure ", "desc": "makes any attack targeted at the ability-bearer - regardless of whether it hits - use 2 PP instead of 1. If a Pokémon with   is the leading party Pokémon, wild Pokémon are 50% more likely to be higher level."},
{"url": "https://pokemondb.net/ability/poison-touch", "name": "Poison Touch ", "desc": "May poison targets when a Pokémon makes contact."},
{"url": "https://pokemondb.net/ability/power-of-alchemy", "name": "Power of Alchemy ", "desc": "The Pokémon copies the Ability of a defeated ally.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/poison-puppeteer", "name": "Poison Puppeteer ", "desc": "Pokémon poisoned by Pecharunt’s moves will also become confused. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/poison-heal", "name": "Poison Heal ", "desc": "Restores HP if the Pokémon is poisoned."},
{"url": "https://pokemondb.net/ability/pickpocket", "name": "Pickpocket ", "desc": "Steals an item when hit by another Pokémon."},
{"url": "https://pokemondb.net/ability/pickup", "name": "Pickup ", "desc": "When another Pokémon on the field uses a single-use held item, a Pokémon with   will obtain the used item (if they are not already holding anything) and it can be used again. Pokémon with   will also obtain an item thrown at them with   (if they are not already holding anything). In  ,   has no effect in battle. When a battle ends, any party Pokémon with   has a 10% chance of picking up an item (if they are not already holding an item). Items picked up range from Potions, Great Balls, Ultra Balls and Rare Candies up to Leftovers and some TMs. Better items have a lower chance of being found; furthermore, higher-level Pokémon will obtain better items."},
{"url": "https://pokemondb.net/ability/pixilate", "name": "Pixilate ", "desc": "causes all  -type attacking moves used by the Pokémon to become  -type, and increase in power by 20%. Fairy-type Pokémon also gain   from those moves (which means an effective increase of 80%). In  ,   increases affected moves' power by 30%."},
{"url": "https://pokemondb.net/ability/perish-body", "name": "Perish Body ", "desc": "When hit by a move that makes direct contact, the Pokémon and the attacker will faint after three turns unless they switch out of battle.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/plus", "name": "Plus ", "desc": "Ups Sp. Atk if another Pokémon has Plus or Minus."},
{"url": "https://pokemondb.net/ability/poison-point", "name": "Poison Point ", "desc": "Contact with the Pokémon may poison the attacker.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/pastel-veil", "name": "Pastel Veil ", "desc": "prevents the Pokémon and its teammates from being poisoned. It also cures teammates of poisoning when it enters the battlefield. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/own-tempo", "name": "Own Tempo ", "desc": "Prevents the Pokémon from becoming confused."},
{"url": "https://pokemondb.net/ability/overcoat", "name": "Overcoat ", "desc": "makes the Pokémon immune to residual damage from weather conditions (specifically   and  )."},
{"url": "https://pokemondb.net/ability/parental-bond", "name": "Parental Bond ", "desc": "allows the ability-bearer to attack twice. The second attack hits with 25% of the power, so in effect it is equivalent to a 25% boost to all attacks.  is the signature ability of  . When the ability is in use, the mother and child each attack. In  , the second attack of   hits with 50% power of the first. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/opportunist", "name": "Opportunist ", "desc": "Copies stat boosts by the opponent.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/orichalcum-pulse", "name": "Orichalcum Pulse ", "desc": "Turns the sunlight harsh when entering battle, and boosts Attack while active.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/overgrow", "name": "Overgrow ", "desc": "increases the power of  -type moves by 50% (1.5×) when the ability-bearer's HP falls below a third of its maximum (known in-game as  )."},
{"url": "https://pokemondb.net/ability/oblivious", "name": "Oblivious ", "desc": "makes the Pokémon immune to gender-based moves and abilities, specifically  ,   and  ."},
{"url": "https://pokemondb.net/ability/mycelium-might", "name": "Mycelium Might ", "desc": "Status moves go last, but are not affected by the opponent's ability.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/normalize", "name": "Normalize ", "desc": "causes all moves used by the Pokémon to become  -type, and attacking moves increase in power by 20%. Normal-type Pokémon also gain   from those moves (which means an effective increase of 80%). The following moves are not affected by  :  ,  ,  ,  ,  ,  ,  ,  , and damaging Z-Moves. The move   deals Normal/Flying type damage instead of Fighting/Flying.   remains super-effective against Water-types, but follows the Normal type chart against other types (e.g. neutral against Grass-types). In  ,   did not increase damage (besides any usual boosts like  ). All moves listed above except Struggle   affected by  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/neuroforce", "name": "Neuroforce ", "desc": "Powers up moves that are super effective.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/no-guard", "name": "No Guard ", "desc": "ensures that all attacks used by, and targeted at, the ability-bearer hit without fail. This includes moves used on a Pokémon in the   stages of the moves  ,  ,   and  . If a Pokémon with   is the leading party Pokémon, wild Pokémon are twice as likely to appear."},
{"url": "https://pokemondb.net/ability/neutralizing-gas", "name": "Neutralizing Gas ", "desc": "Neutralizes abilities of all Pokémon in battle.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/natural-cure", "name": "Natural Cure ", "desc": "All status problems heal when it switches out."},
{"url": "https://pokemondb.net/ability/mummy", "name": "Mummy ", "desc": "Contact with this Pokémon spreads this Ability.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/multiscale", "name": "Multiscale ", "desc": "Reduces damage when HP is full.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/multitype", "name": "Multitype ", "desc": "changes the ability-bearer's type if it is holding one of the   items. Moves of the corresponding type receive  . The moves  ,  ,  ,   or the ability   do not affect a Pokémon with  . The moves  ,  ,   and   cannot remove Plates from a Pokémon with  , but they can remove any other item. The Plates are: In   the moves  ,  ,   and   (all of which remove items) do not affect Pokémon with  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/motor-drive", "name": "Motor Drive ", "desc": "Raises Speed if hit by an Electric-type move."},
{"url": "https://pokemondb.net/ability/misty-surge", "name": "Misty Surge ", "desc": "creates a low-lying mist, like the move  , when the bearer enters battle. It protects all grounded Pokémon from status conditions and halves the power of   type attacks."},
{"url": "https://pokemondb.net/ability/moody", "name": "Moody ", "desc": "Raises one stat and lowers another.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/moxie", "name": "Moxie ", "desc": "increases the user's Attack one stage upon fainting an opponent. Stats can be raised to a maximum of +6 stages each."},
{"url": "https://pokemondb.net/ability/mold-breaker", "name": "Mold Breaker ", "desc": "prevents a target's ability from affecting moves that the   Pokémon uses. It only affects abilities that change the power, accuracy or other effects of moves. For example, a   with   would be able to hit a   (having  ) using a Ground type move like  . Ground type moves would still not affect Flying types. However, if   KOs a Pokémon with  , a   Pokémon would still lose HP as Aftermath did not affect the   attack itself."},
{"url": "https://pokemondb.net/ability/minus", "name": "Minus ", "desc": "Ups Sp. Atk if another Pokémon has Plus or Minus."},
{"url": "https://pokemondb.net/ability/mirror-armor", "name": "Mirror Armor ", "desc": "Reflects any stat-lowering effects.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/mimicry", "name": "Mimicry ", "desc": "Changes type depending on the terrain.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/minds-eye", "name": "Mind's Eye ", "desc": "The Pokémon ignores changes to opponents' evasiveness, its accuracy can't be lowered, and it can hit Ghost types with Normal- and Fighting-type moves. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/merciless", "name": "Merciless ", "desc": "The Pokémon's attacks become critical hits if the target is poisoned.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/marvel-scale", "name": "Marvel Scale ", "desc": "raises the ability-bearer's Defense by 50% when inflicted by a major status ailment (poison, burn, paralysis, freeze or sleep). All effects of the status condition remain, e.g. losing HP each turn (poison, burn), speed drop (paralysis) or being unable to attack (paralysis, freeze, sleep)."},
{"url": "https://pokemondb.net/ability/mega-launcher", "name": "Mega Launcher ", "desc": "increases the power of all   moves by 50%.   boosts the HP restored by 50%. The attacks classed as aura and pulse moves are shown below with their normal and boosted power: No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/magma-armor", "name": "Magma Armor ", "desc": "prevents the Pokémon from becoming frozen, for example from moves like  . If a Pokémon with   (or   or  ) and a   are amongst the party Pokémon, the number of steps required to hatch the egg are halved. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/magician", "name": "Magician ", "desc": "The Pokémon steals the held item of a Pokémon it hits with a move."},
{"url": "https://pokemondb.net/ability/magic-guard", "name": "Magic Guard ", "desc": "protects the Pokémon from indirect damage, including: It does not prevent damage from confusion, trapping moves (e.g.  ) or  . In   a Pokémon with   cannot be poisoned from  , nor become fully immobile through paralysis (though the Speed drop still occurs)."},
{"url": "https://pokemondb.net/ability/magic-bounce", "name": "Magic Bounce ", "desc": "Reflects status- changing moves."},
{"url": "https://pokemondb.net/ability/magnet-pull", "name": "Magnet Pull ", "desc": "prevents   type Pokémon from switching out of battle or fleeing. If a Pokémon with   is the leading party Pokémon, it is 50% more likely that a wild Pokémon encountered will be   type. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/long-reach", "name": "Long Reach ", "desc": "The Pokémon uses its moves without making contact with the target.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/liquid-voice", "name": "Liquid Voice ", "desc": "causes all   moves used by the Pokémon to become Water type. Water type Pokémon also gain   from those moves. It is the signature ability of the   evolution line, though other Pokémon may acquire   via certain abilities or moves such as  . Attacks shown in   can be learned by  , though the others can be called via moves such as  . No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/limber", "name": "Limber ", "desc": "The Pokémon is protected from paralysis."},
{"url": "https://pokemondb.net/ability/libero", "name": "Libero ", "desc": "changes the Pokémon's type to that of its previously used attack. No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/liquid-ooze", "name": "Liquid Ooze ", "desc": "Damages attackers using any draining move.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/light-metal", "name": "Light Metal ", "desc": "halves the Pokémon's weight in battle. Decreasing weight affects these moves:"},
{"url": "https://pokemondb.net/ability/levitate", "name": "Levitate ", "desc": "causes the Pokémon to be   (like  -type Pokémon). Raised Pokémon are not affected by  -type moves,  ,   nor  . Full details in  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/lingering-aroma", "name": "Lingering Aroma ", "desc": "Contact changes the attacker's Ability to Lingering Aroma.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/lightning-rod", "name": "Lightning Rod ", "desc": "forces all single-target  -type moves - used by any other Pokémon on the field - to target this Pokémon, and with 100% accuracy. This includes the status move  . The ability is most useful in double/triple battles. When hit by the move, it deals no damage to the ability-bearer but raises its Special Attack by one stage. Stats can be raised to a maximum of +6 stages each.  will activate for an Electric-type  , but not Electric-type  . The ability is overridden by other Pokémon becoming the   from the moves   or  . In  ,   did not increase Special Attack nor give immunity to Electric-type attacks. It also did not activate for  . In  , this ability's name was formatted as  ."},
{"url": "https://pokemondb.net/ability/leaf-guard", "name": "Leaf Guard ", "desc": "prevents the bearer from succumbing to major status ailments (sleep, burns, poisoning, paralysis or freezing) during sunny weather. It does not prevent minor status ailments such as Confusion or Infatuation, nor does it prevent self-inflicted status conditions such as from using  ."},
{"url": "https://pokemondb.net/ability/klutz", "name": "Klutz ", "desc": "The Pokémon can't use any held items."},
{"url": "https://pokemondb.net/ability/keen-eye", "name": "Keen Eye ", "desc": "prevents the Pokémon from losing accuracy, for example from moves like  . If a Pokémon with   is the leading party Pokémon, wild Pokémon are 50% less likely to be lower level."},
{"url": "https://pokemondb.net/ability/justified", "name": "Justified ", "desc": "raises the ability-bearer's Attack by one stage when hit by a damaging  -type move. The Attack rises for every hit of the move  . Stats can be raised to a maximum of +6 stages each."},
{"url": "https://pokemondb.net/ability/iron-fist", "name": "Iron Fist ", "desc": "increases the power of all   moves by 20%. The attacks classed as punching moves are shown below with their normal and boosted power:"},
{"url": "https://pokemondb.net/ability/iron-barbs", "name": "Iron Barbs ", "desc": "When a Pokémon with   is hit by a move that makes contact, the attacker receives damage equal to   of their maximum HP. Multi-hit moves (e.g.  ) activate   for each strike. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/intrepid-sword", "name": "Intrepid Sword ", "desc": "Boosts Attack in battle.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/intimidate", "name": "Intimidate ", "desc": "lower's the Attack of all opponents by one stage when the ability-bearer switches in (including the start of a battle). Stats can be lowered to a minimum of -6 stages each. If a Pokémon with   is the leading party Pokémon, wild Pokémon are 50% less likely to be lower level."},
{"url": "https://pokemondb.net/ability/illusion", "name": "Illusion ", "desc": "When a Pokémon with the   ability switches into battle, it takes the form of the Pokémon in last place (6th) of the player's party.   will not activate if the Pokémon in last place is the same species or is fainted. The effect is aesthetic only;   does not change the Pokémon's type or moves, so for example a  -type move against a   disguised as   would still be super effective. Any direct attack (i.e. not entry hazards, weather conditions etc) will  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/insomnia", "name": "Insomnia ", "desc": "prevents the ability-bearer from falling asleep, both from moves by other Pokémon like  , and self-inflicted sleep like  . If a sleeping Pokémon aquires   (e.g. from  , it will wake up on its next turn."},
{"url": "https://pokemondb.net/ability/inner-focus", "name": "Inner Focus ", "desc": "prevents the Pokémon from flinching, for example when attacked by a move like  ."},
{"url": "https://pokemondb.net/ability/illuminate", "name": "Illuminate ", "desc": "has no effect in battle. If a Pokémon with   is the leading party Pokémon, wild Pokémon are twice as likely to appear. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/infiltrator", "name": "Infiltrator ", "desc": "ignores the effects of  ,   and  . In other words, if the opponent has used Safeguard,   would still badly poison them."},
{"url": "https://pokemondb.net/ability/immunity", "name": "Immunity ", "desc": "Prevents the Pokémon from getting poisoned."},
{"url": "https://pokemondb.net/ability/imposter", "name": "Imposter ", "desc": "It transforms itself into the Pokémon it is facing.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/innards-out", "name": "Innards Out ", "desc": "When a Pokémon with   faints, it deals damage to the opponent equal to amount of damage it took on the final blow. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/ice-scales", "name": "Ice Scales ", "desc": "Halves damage from Special moves.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/ice-face", "name": "Ice Face ", "desc": "is the signature ability of  . It allows the Pokémon to take a physical attack without taking damage. After the attack,   changes to its   form, however, it can be restored in hail. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/ice-body", "name": "Ice Body ", "desc": "A Pokémon with   will recover   of its maximum HP during hail, after each turn. It also grants immunity to the hailstorm damage, if not already immune."},
{"url": "https://pokemondb.net/ability/hustle", "name": "Hustle ", "desc": "increases the ability-bearer's Attack by 50%, however, it also reduces the Accuracy of all Physical moves by 20%. If a Pokémon with   is the leading party Pokémon, wild Pokémon are 50% more likely to be higher level."},
{"url": "https://pokemondb.net/ability/hunger-switch", "name": "Hunger Switch ", "desc": "causes Morpeko to change its form each turn, alternating between Full Belly Mode and Hangry Mode. Morpeko's form also changes the type of its signature move,  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/hyper-cutter", "name": "Hyper Cutter ", "desc": "prevents the bearer's Attack stat from being lowered by other Pokémon, through moves such as   or abilities such as  . It does not prevent self-inflicted decreases, for example from  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/hydration", "name": "Hydration ", "desc": "A Pokémon with   will cure itself of any status conditions during rain, at the end of each turn. This includes self-inflicted conditions such as from using  ."},
{"url": "https://pokemondb.net/ability/huge-power", "name": "Huge Power ", "desc": "Raises the Pokémon's Attack stat."},
{"url": "https://pokemondb.net/ability/hospitality", "name": "Hospitality ", "desc": "When the Pokémon enters a battle, it showers its ally with hospitality, restoring a small amount of the ally's HP. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/honey-gather", "name": "Honey Gather ", "desc": "has no effect in battle. When a battle ends, any party Pokémon with   may pick up honey as a held item (if they are not already holding an item)."},
{"url": "https://pokemondb.net/ability/heavy-metal", "name": "Heavy Metal ", "desc": "doubles the Pokémon's weight in battle. Increasing weight affects these moves:"},
{"url": "https://pokemondb.net/ability/hadron-engine", "name": "Hadron Engine ", "desc": "Creates an Electric Terrain when entering battle, and boosts Special Attack while active.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/heatproof", "name": "Heatproof ", "desc": "reduces the damage taken from  -type moves by 50%. It also halves the damage from a burn, from   to   of the Pokémon's maximum HP."},
{"url": "https://pokemondb.net/ability/healer", "name": "Healer ", "desc": "May heal an ally's status conditions."},
{"url": "https://pokemondb.net/ability/harvest", "name": "Harvest ", "desc": "May create another Berry after one is used.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/guts", "name": "Guts ", "desc": "raises the ability-bearer's Attack by 50% when inflicted by a major status ailment (poison, burn, paralysis, freeze or sleep). If burnt, the Pokémon does not suffer the usual drop in Attack. All other effects of the status condition remain, e.g. losing HP each turn (poison, burn), speed drop (paralysis) or being unable to attack (paralysis, freeze, sleep)."},
{"url": "https://pokemondb.net/ability/gulp-missile", "name": "Gulp Missile ", "desc": "is the signature ability of  . If   uses the move   or  , it returns with a fish in its mouth. If   then takes damage, it retaliates by spitting out the fish, dealing extra damage.  may also return carrying a  . If   is launched at the opponent they will become paralyzed. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/gorilla-tactics", "name": "Gorilla Tactics ", "desc": "Boosts the Pokémon's Attack stat but only allows the use of the first selected move.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/guard-dog", "name": "Guard Dog ", "desc": "Boosts Attack if intimidated, and prevents being forced to switch out."},
{"url": "https://pokemondb.net/ability/gooey", "name": "Gooey ", "desc": "Contact with the Pokémon lowers the attacker's Speed stat."},
{"url": "https://pokemondb.net/ability/grass-pelt", "name": "Grass Pelt ", "desc": "Boosts the Defense stat in Grassy Terrain.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/grim-neigh", "name": "Grim Neigh ", "desc": "Boosts Special Attack after knocking out a Pokémon.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/grassy-surge", "name": "Grassy Surge ", "desc": "creates a low-lying grassy field, like the move  , when the Pokémon enters battle. It restores the HP of grounded Pokémon each turn and increases the power of   type attacks."},
{"url": "https://pokemondb.net/ability/good-as-gold", "name": "Good as Gold ", "desc": "Gives immunity to status moves.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/gluttony", "name": "Gluttony ", "desc": "A Pokémon with   will use a   when its HP drops to 50%, rather than the usual 25%. Pinch berries are: Figy, Wiki, Mago, Aguav, Iapapa, Liechi, Ganlon, Salac, Petaya, Apicot, Lansat, Starf, Micle and Custap. (Their descriptions state that they work  )"},
{"url": "https://pokemondb.net/ability/galvanize", "name": "Galvanize ", "desc": "Normal-type moves become Electric-type moves and their power boosted.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/gale-wings", "name": "Gale Wings ", "desc": "Gives priority to Flying-type moves.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/fur-coat", "name": "Fur Coat ", "desc": "reduces damage taken from physical attacks by 50%. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/frisk", "name": "Frisk ", "desc": "The Pokémon can check a foe's held item."},
{"url": "https://pokemondb.net/ability/friend-guard", "name": "Friend Guard ", "desc": "Reduces damage done to allies."},
{"url": "https://pokemondb.net/ability/forecast", "name": "Forecast ", "desc": "Castform transforms with the weather.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/forewarn", "name": "Forewarn ", "desc": "Determines what moves a foe has.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/fluffy", "name": "Fluffy ", "desc": "reduces damage from contact moves by 50%, but Fire-type moves do double damage. Fire-type moves that make contact do regular damage."},
{"url": "https://pokemondb.net/ability/flower-veil", "name": "Flower Veil ", "desc": "prevents ally Grass-type Pokémon's stats from being lowered, in double and triple battles. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/flame-body", "name": "Flame Body ", "desc": "If a Pokémon with   is hit by a move that makes contact, there is a 30% chance the attacker will become burned. If a Pokémon with   (or   or  ) and a   are both in the party Pokémon, the number of steps required to hatch the egg are halved."},
{"url": "https://pokemondb.net/ability/filter", "name": "Filter ", "desc": "reduces the damage taken from super-effective attacks by 25%. For example, a Dark-type move used against a Psychic-type Pokémon with   would deal 1.5× the usual damage instead of 2×. A double weakness would be reduced from 4× to 3×."},
{"url": "https://pokemondb.net/ability/flash-fire", "name": "Flash Fire ", "desc": "When a Pokémon with   is hit by a Fire-type move, it does not deal damage but instead raises the power of the bearer's Fire-type moves by 50%. Subsequent hits do not raise the power even more, but the effect remains while the ability-bearer is in battle."},
{"url": "https://pokemondb.net/ability/flower-gift", "name": "Flower Gift ", "desc": "raises the Attack and Special Defense of all party Pokémon by 50% during harsh sunlight. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/flare-boost", "name": "Flare Boost ", "desc": "Powers up special attacks when burned.\n No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/fairy-aura", "name": "Fairy Aura ", "desc": "raises the power of Fairy-type moves by 33%, for all Pokémon on the field (not just the ability-bearer). It is the signature ability of  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/emergency-exit", "name": "Emergency Exit ", "desc": "Switches out when HP falls below 50%.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/earth-eater", "name": "Earth Eater ", "desc": "Restores HP when hit by a Ground-type move.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/embody-aspect", "name": "Embody Aspect ", "desc": "boosts a particular stat, depending on the form of a Terastallized  : No Pokémon have the ability   as a regular ability."},
{"url": "https://pokemondb.net/ability/effect-spore", "name": "Effect Spore ", "desc": "Contact may poison or cause paralysis or sleep."},
{"url": "https://pokemondb.net/ability/early-bird", "name": "Early Bird ", "desc": "The Pokémon awakens quickly from sleep."},
{"url": "https://pokemondb.net/ability/electromorphosis", "name": "Electromorphosis ", "desc": "If a Pokémon with   is hit by an attack, the power of the next Electric-type move it uses is doubled. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/electric-surge", "name": "Electric Surge ", "desc": "creates a low-lying electric field, like the move  , when the Pokémon enters battle. It prevents grounded Pokémon from falling asleep, and increases the power of   type attacks."},
{"url": "https://pokemondb.net/ability/dry-skin", "name": "Dry Skin ", "desc": "causes several effects:"},
{"url": "https://pokemondb.net/ability/drought", "name": "Drought ", "desc": "creates harsh sunlight when the ability-bearer enters battle. The effect lasts 5 turns, unless it is cleared via   or   or replaced by another weather condition. If multiple Pokémon with weather-generating abilities ( ,  ,   or  ) enter the field on the same turn, each weather condition will activate consecutively, fastest Pokémon first. In other words, the resultant weather condition will be that of the slowest Pokémon. Prior to  ,   lasts indefinitely upon activation."},
{"url": "https://pokemondb.net/ability/drizzle", "name": "Drizzle ", "desc": "creates a rain shower when the ability-bearer enters battle. The effect lasts 5 turns, unless it is cleared via   or   or replaced by another weather condition. If multiple Pokémon with weather-generating abilities ( ,  ,   or  ) enter the field on the same turn, each weather condition will activate consecutively, fastest Pokémon first. In other words, the resultant weather condition will be that of the slowest Pokémon. Prior to  ,   lasts indefinitely upon activation."},
{"url": "https://pokemondb.net/ability/disguise", "name": "Disguise ", "desc": "allows the bearer to avoid damage for one attack, in a similar way to  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/dragons-maw", "name": "Dragon's Maw ", "desc": "increases the power of Dragon-type moves used by this Pokémon by 50%. It is the signature ability of Regidrago. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/download", "name": "Download ", "desc": "raises either the bearer's Attack or Special Attack by one stage when switching into battle, base on the opponent's defenses. It raises Attack if the opponent's Defense is lower than its Special Defense, or raises Special Attack if opponent's Special Defense is lower than or equal to its Defense. In double and triple battles,   compares the sum of all opponents' Defense stats and the sum of all opponents' Special Defense stats and uses the lowest total. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/desolate-land", "name": "Desolate Land ", "desc": "creates extremely harsh sunlight when the ability is activated (by Groudon reverting to its Primal form). Extremely harsh sunlight has the same effects as   but with some additions: The abilities   or   are still able to bypass the effects of  , but   is not. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/delta-stream", "name": "Delta Stream ", "desc": "creates strong winds when the ability is activated (by Rayquaza Mega-Evolving). Strong winds have the following effects: The abilities   or   are still able to bypass the effects of  , but   is not. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/defiant", "name": "Defiant ", "desc": "raises the ability-bearer's Attack by two stages when hit by a stat-lowering move. Stats can be raised to a maximum of +6 stages each."},
{"url": "https://pokemondb.net/ability/dazzling", "name": "Dazzling ", "desc": "makes the Pokémon immune to high-priority moves (i.e. those with a priority above 0). No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/defeatist", "name": "Defeatist ", "desc": "When the HP of a Pokémon with   falls below 50%, its Attack and Special Attack stats are halved. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/cute-charm", "name": "Cute Charm ", "desc": "If a Pokémon with   is hit by a move that makes contact, there is a 30% chance the attacker will become infatuated. It will not infatuate Pokémon of the same gender, genderless Pokémon, nor those with the ability  . Infatuated Pokémon have a 50% chance of being   each turn and unable to attack. If a Pokémon with   is the leading party Pokémon, the chance of encountering a Pokémon of the opposite gender is  ."},
{"url": "https://pokemondb.net/ability/damp", "name": "Damp ", "desc": "prevents all Pokémon on the field from using the moves   and  . It also prevents damage (to the   Pokémon only) from the ability  ."},
{"url": "https://pokemondb.net/ability/dauntless-shield", "name": "Dauntless Shield ", "desc": "Boosts Defense in battle.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/dark-aura", "name": "Dark Aura ", "desc": "raises the power of Dark-type moves by 33% for all Pokémon on the field (not just the ability-bearer). It is the signature ability of  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/dancer", "name": "Dancer ", "desc": "When another Pokémon on the field uses any   move,   causes the ability-bearer to use that same move immediately afterward. They will still use their own move originally selected, at the usual time (e.g. after the opponent if they are slower). Effects and status conditions apply for both the copied move and original move. For example if the   Pokémon is confused, they may hurt themselves in confusion when using their move   when copying a Dance move. The moves that   can copy are: No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/chilling-neigh", "name": "Chilling Neigh ", "desc": "Boosts Attack after knocking out a Pokémon.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/chlorophyll", "name": "Chlorophyll ", "desc": "doubles the ability-bearer's Speed during  ."},
{"url": "https://pokemondb.net/ability/cheek-pouch", "name": "Cheek Pouch ", "desc": "restores the bearer's HP when a Berry is consumed, on top of the berry's usual effects. So for example, it may cure a status condition and restore HP, or restore more HP than normal. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/clear-body", "name": "Clear Body ", "desc": "Prevents other Pokémon from lowering its stats."},
{"url": "https://pokemondb.net/ability/berserk", "name": "Berserk ", "desc": "raises the Pokémon's Special Attack by one stage when its HP falls below 50%. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/big-pecks", "name": "Big Pecks ", "desc": "prevents the ability-bearer's Defense stat from being lowered, for example via  ."},
{"url": "https://pokemondb.net/ability/blaze", "name": "Blaze ", "desc": "increases the power of  -type moves by 50% (1.5×) when the ability-bearer's HP falls below a third of its maximum (known in-game as  )."},
{"url": "https://pokemondb.net/ability/bulletproof", "name": "Bulletproof ", "desc": "makes the Pokémon immune to   moves. In  , Rock Blast is not affected by  ."},
{"url": "https://pokemondb.net/ability/beads-of-ruin", "name": "Beads of Ruin ", "desc": "Lowers Special Defense of all Pokémon except itself.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/beast-boost", "name": "Beast Boost ", "desc": "The Pokémon boosts its most proficient stat each time it knocks out a Pokémon.\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/battle-bond", "name": "Battle Bond ", "desc": "causes Greninja to transform into Ash-Greninja when it KOs an opponent.  also increases the power of Greninja's signature move  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/ball-fetch", "name": "Ball Fetch ", "desc": "If the Pokémon is not holding an item, it will fetch the Poké Ball from the first failed throw of the battle. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/as-one", "name": "As One ", "desc": "Combines Unnerve and Chilling Neigh/Grim Neigh\n No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/bad-dreams", "name": "Bad Dreams ", "desc": "causes all sleeping opponents to lose   of their maximum HP at the end of each turn. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/battle-armor", "name": "Battle Armor ", "desc": "prevents the Pokémon from receiving a critical hit."},
{"url": "https://pokemondb.net/ability/battery", "name": "Battery ", "desc": "allows the Pokémon to raise the power of teammates' special moves. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/aura-break", "name": "Aura Break ", "desc": "cancels the effects of the abilities   and   and instead reduces the power of Dark-type and Fairy-type moves by 25%, for all Pokémon on the field.  is not affected by the abilities  ,  , or  .  is the signature ability of  . Similarly, the abilities it reverses are also signature abilities of legendary Pokémon from Pokémon X&Y:   and  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/armor-tail", "name": "Armor Tail ", "desc": "prevents the opponent from using any moves that have priority, such as  . No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/aroma-veil", "name": "Aroma Veil ", "desc": "Protects allies from attacks that limit their move choices."},
{"url": "https://pokemondb.net/ability/arena-trap", "name": "Arena Trap ", "desc": "prevents opponents from fleeing or switching out.   Pokémon are not affected. Raised Pokémon are any   types or those under the effects of  ,   or  . Full details in  . If a Pokémon with   is the leading party Pokémon, wild Pokémon are twice as likely to appear. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/anger-shell", "name": "Anger Shell ", "desc": "When the Pokémon's HP drops below half,   lowers its Defense and Special Defense but its Attack, Special Attack and Speed are raised. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/air-lock", "name": "Air Lock ", "desc": "suppresses   effects brought on by weather, including move power increases, end-of-turn damage, accuracy changes, relevant abilities and so on. No Pokémon have   as a hidden ability."},
{"url": "https://pokemondb.net/ability/anticipation", "name": "Anticipation ", "desc": "A Pokémon with   will   upon entering battle, if an opponent has a move that is super-effective against it, or a One-Hit-KO move ( ,  ,   or  ). It only activates when the ability-bearer switches in, not when an opponent switches in.  does not activate if the opponent has a move that varies in type, such as  ,   or  , even if those moves would be super-effective."},
{"url": "https://pokemondb.net/ability/anger-point", "name": "Anger Point ", "desc": "raises the ability-bearer's Attack to its maximum level - +6 stages or 4× usual power - when a move targeting it receives a critical hit."},
{"url": "https://pokemondb.net/ability/analytic", "name": "Analytic ", "desc": "Boosts move power when the Pokémon moves last.\n No Pokémon have the ability   as a regular ability."}
]